# EdgeArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayIterator Class
Members See Also
---
An iterator to an edge array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class EdgeArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class EdgeArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class EdgeArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..EdgeArrayIterator
# See Also
EdgeArrayIterator Members
Autodesk.Revit.DB Namespace